перепши эти джойны кликсенса на преобразования типа     
to_char(date_trunc('quarter', to_date(s.ACCIDENT_MONTH, 'YYYYMM')), 'YYYY_"_"Q') AS event_quarter,

Left Join (Данные)
LOAD
    [Месяц события] as Год_месяц,
    year(Дата) as Год,
    Month(Дата) as Месяц,
    date(Дата) as DS,
    Квартал
FROM [lib://qfs_Actuary/Справочники для треугольников.xlsx](ooxml, embedded labels, table is Кварталы);

Left Join (Данные)
LOAD
	[Месяц события] as [Месяц начала],
    [Квартал события] as [Квартал начала],
    year(Дата) as [Год начала],
    date(Дата) as DN
FROM [lib://qfs_Actuary/Справочники для треугольников.xlsx](ooxml, embedded labels, table is Кварталы);

вот пример данных из справочника дляпонимания маски
Месяц события	Квартал события	Дата	Квартал
201901	2019_1	01.01.2019	1
201902	2019_1	01.02.2019	1
201903	2019_1	01.03.2019	1
201904	2019_2	01.04.2019	2
201905	2019_2	01.05.2019	2
201906	2019_2	01.06.2019	2
201907	2019_3	01.07.2019	3
201908	2019_3	01.08.2019	3
201909	2019_3	01.09.2019	3
201910	2019_4	01.10.2019	4
201911	2019_4	01.11.2019	4
201912	2019_4	01.12.2019	4
202001	2020_1	01.01.2020	1
202002	2020_1	01.02.2020	1
202003	2020_1	01.03.2020	1
202004	2020_2	01.04.2020	2
202005	2020_2	01.05.2020	2
202006	2020_2	01.06.2020	2
202007	2020_3	01.07.2020	3
202008	2020_3	01.08.2020	3
202009	2020_3	01.09.2020	3
202010	2020_4	01.10.2020	4
202011	2020_4	01.11.2020	4
202012	2020_4	01.12.2020	4
202101	2021_1	01.01.2021	1
202102	2021_1	01.02.2021	1
202103	2021_1	01.03.2021	1
202104	2021_2	01.04.2021	2
202105	2021_2	01.05.2021	2
202106	2021_2	01.06.2021	2
202107	2021_3	01.07.2021	3
202108	2021_3	01.08.2021	3
202109	2021_3	01.09.2021	3
