SELECT 
    "Тип страхователя",
    "Признак пролонгации",
    "Месяц действия",
    "Месяц календарный",
    "Отв_Пр",
    -- Сумма по 4 полям (без учета Отв_Пр)
    SUM("Экспозиция") OVER (PARTITION BY 
        "Тип страхователя",
        "Признак пролонгации",
        "Месяц действия",
        "Месяц календарный"
    ) AS "Сумма_Экспозиции",
    
    -- Сумма по 5 полям (с учетом Отв_Пр)
    SUM("MCL") OVER (PARTITION BY 
        "Тип страхователя",
        "Признак пролонгации",
        "Месяц действия",
        "Месяц календарный",
        "Отв_Пр"
    ) AS "Сумма_MCL"
FROM "Данные_RS"
GROUP BY 
    "Тип страхователя",
    "Признак пролонгации",
    "Месяц действия",
    "Месяц календарный",
    "Отв_Пр",
    "Экспозиция",
    "MCL";
